[
    {
        "id": 1,
        "name": "Paris, France",
        "image": "paris.jpg",
        "description": "The city of lights and love, famous for its art, fashion, and landmarks.",
        "details": {
            "long_description": "Paris, the capital of France, is known for its iconic Eiffel Tower, world-class museums like the Louvre, and charming cafés.",
            "itinerary": [
                "Day 1: Arrive in Paris, visit the Eiffel Tower, and explore the Seine River.",
                "Day 2: Discover the Louvre Museum and stroll through the Champs-Élysées.",
                "Day 3: Visit Montmartre, Sacré-Cœur Basilica, and enjoy a Seine river cruise."
            ]
        },
        "location": {
            "latitude": 48.8566,
            "longitude": 2.3522
        }
    },
    {
        "id": 2,
        "name": "Kyoto, Japan",
        "image": "images/kyoto.jpg",
        "description": "A city of temples and tradition, where the past meets the present.",
        "details": {
            "long_description": "Kyoto, Japan's cultural heart, is home to ancient temples, stunning gardens, and traditional tea houses.",
            "itinerary": [
                "Day 1: Visit Fushimi Inari Shrine and explore Gion district.",
                "Day 2: Tour Kinkaku-ji (Golden Pavilion) and Arashiyama Bamboo Forest.",
                "Day 3: Experience a traditional tea ceremony and visit Nijo Castle."
            ]
        },
        "location": {
            "latitude": 35.0116,
            "longitude": 135.7681
        }
    },
    {
        "id": 3,
        "name": "New York City, USA",
        "image": "images/nyc.jpg",
        "description": "The city that never sleeps, full of skyscrapers, Broadway, and Central Park.",
        "details": {
            "long_description": "New York City is a melting pot of cultures and entertainment, featuring Times Square, the Statue of Liberty, and world-class museums.",
            "itinerary": [
                "Day 1: Visit Times Square, Broadway, and the Empire State Building.",
                "Day 2: Explore Central Park, the Metropolitan Museum of Art, and 5th Avenue shopping.",
                "Day 3: Take a ferry to the Statue of Liberty and enjoy a skyline view from Brooklyn Bridge."
            ]
        },
        "location": {
            "latitude": 40.7128,
            "longitude": -74.0060
        }
    },
    {
        "id": 4,
        "name": "Santorini, Greece",
        "image": "images/santorini.jpg",
        "description": "Famous for its white-washed buildings, blue domes, and stunning sunsets.",
        "details": {
            "long_description": "Santorini is a Greek island known for its picturesque villages, volcanic beaches, and breathtaking caldera views.",
            "itinerary": [
                "Day 1: Explore Fira and Oia, watch the sunset at Oia Castle.",
                "Day 2: Visit the ancient ruins of Akrotiri and relax on the Red Beach.",
                "Day 3: Enjoy a sailing tour of the volcanic islands and hot springs."
            ]
        },
        "location": {
            "latitude": 36.3932,
            "longitude": 25.4615
        }
    }
]